# UnoccupiedCoolingSetPoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadBuildingType..::..UnoccupiedCoolingSetPoint Property
HVACLoadBuildingType Class See Also
---
The unoccupied cooling set point of the building type with unit kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public double UnoccupiedCoolingSetPoint { get; set; }
```

Visual Basic
---
```text
Public Property UnoccupiedCoolingSetPoint As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double UnoccupiedCoolingSetPoint {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The value should be between (273.15, 373.15] with unit kelvin (K). |

# See Also
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace